import i18n from 'i18next';
import { initReactI18next } from 'react-i18next';

const resources = {
  en: {
    translation: {
      "7": "7", "8": "8", "9": "9", "C": "C",
      "4": "4", "5": "5", "6": "6", "/": "/",
      "1": "1", "2": "2", "3": "3", "*": "×",
      "0": "0", ".": ".", "=": "=", "-": "-",
      "+": "+", "sin": "Sin", "cos": "Cos", "tan": "Tan",
      "log": "Log", "sqrt": "√", "(": "(", ")": ")", "%": "%",
      "language": "Change Language",
      "title":"Scientific"
      
    }
  },
  ur: {
    translation: {
      "7": "۷", "8": "۸", "9": "۹", "C": "صاف",
      "4": "۴", "5": "۵", "6": "۶", "/": "تقسیم",
      "1": "۱", "2": "۲", "3": "۳", "*": "ضرب",
      "0": "۰", ".": "نقطہ", "=": "برابر", "-": "منفی",
      "+": "جمع", "sin": "سائن", "cos": "کوز", "tan": "ٹین",
      "log": "لاگ", "sqrt": "جذر", "(": "(", ")": ")", "%": "%",
      "language": "زبان تبدیل کریں",
        "switch_to_basic": "بنیادی موڈ میں تبدیل کریں",
        "switch_to_scientific": "سائنسی موڈ میں تبدیل کریں",
        "title":"سائنسی"
      
      
    }
  },
  ko: {
    translation: {
      "7": "7", "8": "8", "9": "9", "C": "지우기",
      "4": "4", "5": "5", "6": "6", "/": "나누기",
      "1": "1", "2": "2", "3": "3", "*": "곱하기",
      "0": "0", ".": ".", "=": "=", "-": "-",
      "+": "+", "sin": "사인", "cos": "코사인", "tan": "탄젠트",
      "log": "로그", "sqrt": "제곱근", "(": "(", ")": ")", "%": "%",
      "language": "언어 변경",
       "switch_to_basic": "기본 모드로 전환",
  "switch_to_scientific": "과학 모드로 전환",
  "title":"과학적인"
    }
  },
  jp: {
    translation: {
      "7": "7", "8": "8", "9": "9", "C": "クリア",
      "4": "4", "5": "5", "6": "6", "/": "割る",
      "1": "1", "2": "2", "3": "3", "*": "掛ける",
      "0": "0", ".": ".", "=": "=", "-": "-",
      "+": "+", "sin": "サイン", "cos": "コサイン", "tan": "タンジェント",
      "log": "ログ", "sqrt": "平方根", "(": "(", ")": ")", "%": "%",
      "language": "言語を変更する",
      "switch_to_basic": "基本モードに切り替え",
      "switch_to_scientific": "科学モードに切り替え",
      "title":"科学的"
    }
  }
};

i18n.use(initReactI18next).init({
  resources,
  lng: 'en', // Default language
  fallbackLng: 'en',
  interpolation: { escapeValue: false },
});

export default i18n;
